[DIALOG_102]
BUTTON_1000=Firmware
BUTTON_1001=Run
BUTTON_1002=Demo
BUTTON_1003=Upgrade
BUTTON_1004=Restore
BUTTON_1005=Language
BUTTON_1006=Exit
BUTTON_1013=
BUTTON_1056=Demo
DIALOG_TITLE=FactoryTool
LABEL_1012=
LABEL_1014=Firmware:
LABEL_1015=Demo
LABEL_1016=Firmware Ver:
LABEL_1017=Loader Ver:
LABEL_1018=Chip:
LABEL_1019=
LABEL_1020=Wizard:
LABEL_1021=ID:
LABEL_1022=ID:
LABEL_1023=ID:
LABEL_1024=ID:
LABEL_1025=ID:
LABEL_1026=ID:
LABEL_1027=ID:
LABEL_1028=ID:
LABEL_1029=ID:
LABEL_1030=ID:
LABEL_1031=ID:
LABEL_1032=ID:
LABEL_1033=
LABEL_1034=
LABEL_1035=
LABEL_1036=
LABEL_1037=
LABEL_1038=
LABEL_1039=
LABEL_1040=
LABEL_1041=
LABEL_1042=
LABEL_1043=
LABEL_1044=
LABEL_1045=
LABEL_1050=Success:
LABEL_1051=0
LABEL_1052=Fail:
LABEL_1053=0
LABEL_1054=Total:
LABEL_1055=0
[MENU_500]
MENU_500_0=Chinese
MENU_500_1=English
[PROMPT]
IDS_HELP=1.First use,Tag USB port:plug device in,record ID showing on the tool.Tag all.\r\n\r\n2.After pluging device in,connect another until device is doing upgrade.\r\n\r\n3.led is green,plug device in;led is red,do not plug device in or out.\r\n\r\n4.After finishing upgrade,green to show success,red to show failure.\r\n\r\n5.To show successful device on the right of grid and failed device on the left of grid.
IDS_DEVICELIST=Device List
IDS_DEVICETYPE=Device Type
IDS_ID=ID
IDS_PROCESS=Process
IDS_PROMPT=Upgrade Prompt
IDS_MYCOMPUTER=My Computer
IDS_HIGH_CONTROLLER=USB2.0 Controller
IDS_FULL_CONTROLLER=USB Controller
IDS_RUN_TEXT=Run
IDS_STOP_TEXT=Stop
IDS_FAIL_TEXT=Fail
IDS_SUCCESS_TEXT=Success
IDS_RESULT_TEXT=Result
IDS_TIME_TEXT=Time
IDS_LOADING_FW=Loading...
IDS_LOADFWFAIL=Error:Loading firmware failed!

IDS_ERRBYCREATESCANFAIL=Failing to create scan object!
IDS_ERRBYCREATECOMMFAIL=Failing to create comm object!
IDS_ERRBYCREATEDEVICEFAIL=Failing to create device object!
IDS_ERRBYCREATESTEPFAIL=Failing to create upgrade step!
IDS_ERRBYCREATEUPGRADEFAIL=Failing to create upgrade object!
IDS_ERRBYSETOBJECTFAIL=Failing to set upgrade object!
IDS_CREATEUIDFAIL=Failing to create device's uid!

IDS_TESTDEVICEPROGRESSINFO=Test Device(%d%%)...
IDS_LOWERFORMATPROGRESSINFO=Lowerformat Device(%d%%)...
IDS_DOWNLOADIMAGEPROGRESSINFO=Download Firmware(%d%%)...
IDS_CHECKIMAGEPROGRESSINFO=Check Firmware(%d%%)...
IDS_TAGBADBLOCKPROGRESSINFO=Tag Bad Block(%d%%)...
IDS_TESTBLOCKPROGRESSINFO=Test Block(%d%%)...
IDS_ERASEFLASHPROGRESSINFO=Erase Flash(%d%%)...
IDS_ERASESYSTEMPROGRESSINFO=Erase System(%d%%)...
IDS_ERASEUSERDATAPROGRESSINFO=Erase Userdata(%d%%)...

IDS_DOWNLOADBOOT_START=Download Boot Start
IDS_DOWNLOADBOOT_FAIL=Download Boot Fail
IDS_DOWNLOADBOOT_PASS=Download Boot Success
IDS_DOWNLOADIDBLOCK_START=Download IDB Start
IDS_DOWNLOADIDBLOCK_FAIL=Download IDB Fail
IDS_DOWNLOADIDBLOCK_PASS=Download IDB Success
IDS_DOWNLOADIMAGE_START=Download Firmware Start
IDS_DOWNLOADIMAGE_FAIL=Download Firmware Fail
IDS_DOWNLOADIMAGE_PASS=Download Firmware Success
IDS_TESTDEVICE_START=Test Device Start
IDS_TESTDEVICE_FAIL=Test Device Fail
IDS_TESTDEVICE_PASS=Test Device Success
IDS_LOWERFORMATDEVICE_START=Lowerformat Device Start
IDS_LOWERFORMATDEVICE_FAIL=Lowerformat Device Fail
IDS_LOWERFORMATDEVICE_PASS=Lowerformat Device Success
IDS_RESETDEVICE_START=Reset Device Start
IDS_RESETDEVICE_FAIL=Reset Device Fail
IDS_RESETDEVICE_PASS=Reset Device Success
IDS_SETRESETFLAG_START=Reset Device To Msc Start
IDS_SETRESETFLAG_FAIL=Reset Device To Msc Fail
IDS_SETRESETFLAG_PASS=Reset Device To Msc Success
IDS_FORMATDISK_START=Format Disk Start
IDS_FORMATDISK_FAIL=Format Disk Fail
IDS_FORMATDISK_PASS=Format Disk Success
IDS_COPYDATA_START=Copy Data Start
IDS_COPYDATA_FAIL=Copy Data Fail
IDS_COPYDATA_PASS=Copy Data Success
IDS_WAITMSC_START=Wait For MSC Start
IDS_WAITMSC_FAIL=Wait For MSC Fail
IDS_WAITMSC_PASS=Wait For MSC Success
IDS_WAITLOADER_START=Wait For Loader Start
IDS_WAITLOADER_FAIL=Wait For Loader Fail
IDS_WAITLOADER_PASS=Wait For Loader Success
IDS_WAITMASKROM_START=Wait For Maskrom Start
IDS_WAITMASKROM_FAIL=Wait For Maskrom Fail
IDS_WAITMASKROM_PASS=Wait For Maskrom Success
IDS_ERASEIDB_START=Erase IDB Start
IDS_ERASEIDB_FAIL=Erase IDB Fail
IDS_ERASEIDB_PASS=Erase IDB Success
IDS_SWITCHMSC_START=Switch MSC Start
IDS_SWITCHMSC_FAIL=Switch MSC Fail
IDS_SWITCHMSC_PASS=Switch MSC Success
IDS_RESETMSC_START=Reset MSC Start
IDS_RESETMSC_FAIL=Reset MSC Fail
IDS_RESETMSC_PASS=Reset MSC Success
IDS_SHOWUSERDISK_START=Show User Disk Start
IDS_SHOWUSERDISK_FAIL=Show User Disk Fail
IDS_SHOWUSERDISK_PASS=Show User Disk Success
IDS_CHECKCHIP_START=Check Chip Start
IDS_CHECKCHIP_FAIL=Check Chip Fail
IDS_CHECKCHIP_PASS= Check Chip Success
IDS_GETFLASHINFO_START=Get FlashInfo Start
IDS_GETFLASHINFO_FAIL=Get FlashInfo Fail
IDS_GETFLASHINFO_PASS=Get FlashInfo Success
IDS_PREPAREIDB_START=Prepare IDB Start
IDS_PREPAREIDB_FAIL=Prepare IDB Fail
IDS_PREPAREIDB_PASS=Prepare IDB Success
IDS_MUTEXRESETDEVICE_START=Mutex Reset Device Start
IDS_MUTEXRESETDEVICE_FAIL=Mutex Reset Device Fail
IDS_MUTEXRESETDEVICE_PASS=Mutex Reset Device Success
IDS_ERASEALLBLOCKS_START=Erase Flash Start
IDS_ERASEALLBLOCKS_FAIL=Erase Flash Fail
IDS_ERASEALLBLOCKS_PASS=Erase Flash Success
IDS_GETBLOCKSTATE_START=Get Block State Start
IDS_GETBLOCKSTATE_FAIL=Get Block State Fail
IDS_GETBLOCKSTATE_PASS=Get Block State Success
IDS_FINDUSERDISK_START=Find User Disk Start
IDS_FINDUSERDISK_FAIL=Find User Disk Fail
IDS_FINDUSERDISK_PASS=Find User Disk Pass
IDS_UPGRADE_SUCCESS=Upgrade OK
IDS_RESTORE_SUCCESS=Restore OK